In [1]:
# import os

In [1]:
from env import my_setup

In [2]:
my_setup()

import os
from pydataset import data
import seaborn as sns
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import math as m
from env import get_db_url
from env import gdb

In [3]:
import os
from pydataset import data
import seaborn as sns
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import math as m
# from env import get_db_url
from env import gdb

In [4]:
get_db_url('chipotle')

NameError: name 'get_db_url' is not defined

In [5]:
mpg = data('mpg')

In [6]:
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl    class
1         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
2         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
3         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
4         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
5         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [11]:
help(gdb)

Help on function gdb in module env:

gdb(db_name, query)
    gdb(db_name, query):

        takes in    a (db_name) schema name from the codeup database
        and         a (query) to the MySQL server

        and         returns the query using pd.read_sql(query, url)
        having      created the url from my environment file

In [7]:
orders = gdb('chipotle', 'SELECT * FROM orders')

In [8]:
type(orders)

pandas.core.frame.DataFrame

In [9]:
orders.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98